package com.example.selfevaluation.data;

import com.example.selfevaluation.model.Chapter;
import com.example.selfevaluation.model.Module;
import com.example.selfevaluation.model.Question;

import java.util.ArrayList;
import java.util.List;

public class Data {


    public static List<Module> getData() {
        List<Module> modules = new ArrayList<>();
        for (int k = 2; k < 5; k++) {
            Module module = new Module();
            module.setId("Ikai" + k);
            module.setChapters(getChapters());
            modules.add(module);
        }
        return modules;
    }

    private static List<Chapter> getChapters() {
        List<Chapter> chapters = new ArrayList<>();

        for (int j = 0; j < 2; j++) {
            Chapter chapter = new Chapter();
            chapter.setId("Chapter Name" + j);
            chapter.setQuestions(getQuestions());
            chapters.add(chapter);
        }
        return chapters;
    }


    private static List<Question> getQuestions() {
        List<Question> questionList = new ArrayList<>();
        for (int i = 0; i < 10; i++) {
            Question question = new Question();
            question.setQuestion("Question" + i);
            question.setAnswer("d");
            question.setOptions(new ArrayList<String>() {{

                add("aq");
                add("bq");
                add("cq");
                add("dq");
            }});
            questionList.add(question);
        }
        return questionList;
    }

    public static final String JSON_DATA="[\n" +
            "  {\n" +
            "    \"chapters\": [\n" +
            "      {\n" +
            "        \"id\": \"पाठ 1 - जिस गली में मैं रहता हूँ।\",\n" +
            "        \"questions\": [\n" +
            "          {\n" +
            "            \"answer\": \"d\",\n" +
            "            \"options\": [\n" +
            "              \"लेख\",\n" +
            "              \"कहानी \",\n" +
            "              \"कविता \",\n" +
            "              \"डायरी\"\n" +
            "            ],\n" +
            "            \"question\": \"जिस गली में मैं रहता हूँ नामक पाठ भाग किस विधा की रचना है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"d\",\n" +
            "            \"options\": [\n" +
            "              \"अरविंद गुप्ता\",\n" +
            "              \"प्रेमचंद\",\n" +
            "              \"मिर्जा गालिब \",\n" +
            "              \"डॉ कैलाश नारद\"\n" +
            "            ],\n" +
            "            \"question\": \"इस डायरी का  अनुवादक  का नाम क्या है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \" दिल्ली\",\n" +
            "              \"मुंबई\",\n" +
            "              \"मधुरा\",\n" +
            "              \"आगरा\"\n" +
            "            ],\n" +
            "            \"question\": \"डायरी में प्रतिपादित प्रदेश का नाम क्या है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"c\",\n" +
            "            \"options\": [\n" +
            "              \"5 सितंबर 1857\",\n" +
            "              \"5 जून 1857\",\n" +
            "              \"5  अक्टूबर 1857\",\n" +
            "              \"5 मई 1857\"\n" +
            "            ],\n" +
            "            \"question\": \"मिर्जा गालिब के अनुसार असली मुसीबत कब आई?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"d\",\n" +
            "            \"options\": [\n" +
            "              \"काला\",\n" +
            "              \"हरा\",\n" +
            "              \"पीला\",\n" +
            "              \"सुर्ख\"\n" +
            "            ],\n" +
            "            \"question\": \"ब्राउन का चेहरा ------था |\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"कविता लिखते हैं |  \",\n" +
            "              \"पुलिस में काम करते हैं |\",\n" +
            "              \"अध्यापन कार्य करता हैं |\",\n" +
            "              \"बिना काम |\"\n" +
            "            ],\n" +
            "            \"question\": \"मिर्जा गालिब क्या करते हैं ?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"भिश्ती\",\n" +
            "              \"शिल्पी\",\n" +
            "              \"अध्यापक\",\n" +
            "              \"दुकानदार\"\n" +
            "            ],\n" +
            "            \"question\": \"चिराग अली कौन था?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"हड़सन\",\n" +
            "              \"ब्राउन\",\n" +
            "              \"डायर\",\n" +
            "              \"मिन्टो\"\n" +
            "            ],\n" +
            "            \"question\": \"चिराग अली को किसने मारा?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \"बालमुकुंद\",\n" +
            "              \"हरिगोपाल तुफ्ता\",\n" +
            "              \"हीराराम\",\n" +
            "              \"हीरा सिंह\"\n" +
            "            ],\n" +
            "            \"question\": \"मिर्जा गालिब का दोस्त का नाम क्या है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"c\",\n" +
            "            \"options\": [\n" +
            "              \"मिर्जा गालिब\",\n" +
            "              \"हडसन\",\n" +
            "              \"हीरा सिंह\",\n" +
            "              \"हरि गोपाल\"\n" +
            "            ],\n" +
            "            \"question\": \"बालमुकुंद का पिता का नाम क्या है?\"\n" +
            "          }\n" +
            "        ]\n" +
            "      },\n" +
            "      {\n" +
            "        \"id\": \"पाठ 2- गाँधीजी गाँधीजी कैसे बने\",\n" +
            "        \"questions\": [\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \"डॉ कैलाश नारद\",\n" +
            "              \"स्वयंप्रकाश\",\n" +
            "              \"वरुण ग्रोवर\",\n" +
            "              \"अरविंद गुप्ता\"\n" +
            "            ],\n" +
            "            \"question\": \"'गांधीजी गांधीजी कैसे बने' लेख का रचनाकार कौन है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"अंधेरे से\",\n" +
            "              \"जानवरों से\",\n" +
            "              \"अंग्रेजों से\",\n" +
            "              \"गणित से\"\n" +
            "            ],\n" +
            "            \"question\": \" बचपन में गांधीजी को किस से डर था?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"c\",\n" +
            "            \"options\": [\n" +
            "              \" इंग्लैंड\",\n" +
            "              \"दक्षिण अफ्रीका\",\n" +
            "              \"मदुरै\",\n" +
            "              \"लंदन\"\n" +
            "            ],\n" +
            "            \"question\": \"अब मैं सिर्फ एक धोती  ही पहनूँगा* यह  फ़ैसला गाँधीजी  कहाँ  जाने के बाद लिया?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"c\",\n" +
            "            \"options\": [\n" +
            "              \"पुतली बाई  को\",\n" +
            "              \"मणिलाल गांधी को\",\n" +
            "              \"भारत के वायसरॉय को\",\n" +
            "              \"रानी को\"\n" +
            "            ],\n" +
            "            \"question\": \"गांधीजी  अपने पेंसिल से पहली  चिट्ठी किसको लिखी?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"c\",\n" +
            "            \"options\": [\n" +
            "              \"पेंसिल\",\n" +
            "              \"धोती\",\n" +
            "              \"तीन बंदर की खिलौना\",\n" +
            "              \"जूते\"\n" +
            "            ],\n" +
            "            \"question\": \"चीनी बच्चों ने गांधीजी को क्या दिया\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"d\",\n" +
            "            \"options\": [\n" +
            "              \"मदुरै \",\n" +
            "              \"दक्षिण अफ्रीका\",\n" +
            "              \"बरमा\",\n" +
            "              \"लंदन\"\n" +
            "            ],\n" +
            "            \"question\": \" गांधीजी गोल मेज सम्मेलन के लिए कहां गए थे?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \"पाँचवां\",\n" +
            "              \"पहला\",\n" +
            "              \"दसवाँ\",\n" +
            "              \"तीसरा\"\n" +
            "            ],\n" +
            "            \"question\": \"गांधीजी को काठियावाड़  हाई स्कूल में कौन सी कक्षा में भर्ती मिला?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"20  जनवरी 1947\",\n" +
            "              \"20 फरवरी 1947\",\n" +
            "              \"10  जनवरी 1947\",\n" +
            "              \"10 फरवरी 1947\"\n" +
            "            ],\n" +
            "            \"question\": \"स्वयंप्रकाश का जन्म कब हुई?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"d\",\n" +
            "            \"options\": [\n" +
            "              \"सूरज कब निकलेगा |\",\n" +
            "              \"आएंगे अच्छे दिन भी |\",\n" +
            "              \"गांधीजी गांधीजी कैसे बने |\",\n" +
            "              \"नंगे पैर\"\n" +
            "            ],\n" +
            "            \"question\": \"इस में कौन सा रचना स्वयंप्रकाश का नहीं है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"औरत की\",\n" +
            "              \"चीनी  बच्चों की\",\n" +
            "              \"अमीर आदमी की\",\n" +
            "              \"दक्षिण अफ्रीका के लोगों की\"\n" +
            "            ],\n" +
            "            \"question\": \"किसकी हालत देखकर गांधीजी एक धोती  पहनने  की फ़ैंसला  लिया?\"\n" +
            "          }\n" +
            "        ]\n" +
            "      }\n" +
            "    ],\n" +
            "    \"id\": \"इकाई 2\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"chapters\": [\n" +
            "      {\n" +
            "        \"id\": \"पाठ 1 नंगे पैर\",\n" +
            "        \"questions\": [\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"कहानी\",\n" +
            "              \"लोककथा\",\n" +
            "              \"कविता\",\n" +
            "              \"पटकथा\"\n" +
            "            ],\n" +
            "            \"question\": \"*नंगे पैर* किस विधा की रचना है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"c\",\n" +
            "            \"options\": [\n" +
            "              \"मिर्जा गालिब\",\n" +
            "              \"स्वयं प्रकाश\",\n" +
            "              \"वेंकटेश  माडगुलकर \",\n" +
            "              \"नरेंद्र पुंडरीक\"\n" +
            "            ],\n" +
            "            \"question\": \"नंगे पैर कहानी का रचनाकार कौन है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"d\",\n" +
            "            \"options\": [\n" +
            "              \"लल्लू\",\n" +
            "              \"वरुण ग्रोवर\",\n" +
            "              \"मेहरून्निसा\",\n" +
            "              \"बेबी\"\n" +
            "            ],\n" +
            "            \"question\": \" नंगे पैर कहानी का मुख्य पात्र का नाम क्या है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"c\",\n" +
            "            \"options\": [\n" +
            "              \" खाना खा रही थी |\",\n" +
            "              \"टीवी देख रही थी |\",\n" +
            "              \"पलंग पर बैठी खिड़की से बाहर देख रही थी |\",\n" +
            "              \"खेल रही थी |\"\n" +
            "            ],\n" +
            "            \"question\": \"दोपहर का समय बेबी क्या कर रही थी?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"d\",\n" +
            "            \"options\": [\n" +
            "              \"बाप\",\n" +
            "              \"नाना\",\n" +
            "              \"दीदी\",\n" +
            "              \"माँ \"\n" +
            "            ],\n" +
            "            \"question\": \"बेबी ने  डाक किसके हाथ में दिया?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"पोस्टमैन\",\n" +
            "              \"मोची\",\n" +
            "              \" माँ \",\n" +
            "              \"बाप\"\n" +
            "            ],\n" +
            "            \"question\": \"दोपहर को  बेबी के घर में कौन आया?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"c\",\n" +
            "            \"options\": [\n" +
            "              \" पत्र \",\n" +
            "              \"कलम\",\n" +
            "              \"जूते\",\n" +
            "              \"खाना\"\n" +
            "            ],\n" +
            "            \"question\": \"बेबी पोस्टमैन को क्या तैयार करके दिया?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"c\",\n" +
            "            \"options\": [\n" +
            "              \"बेबी के पास पोस्टमैन को देने के लिए पैसा नहीं था |\",\n" +
            "              \"पिताजी ने पोस्टमैन को जूते देने को कहा था |\",\n" +
            "              \"बेबी ने पोस्टमैन को कड़ी धूप में नंगे पैर चलते देखा था |\",\n" +
            "              \"पोस्टमैने ने  बेबी से जूते माँगे  थे |\"\n" +
            "            ],\n" +
            "            \"question\": \"बेबी ने पोस्टमैन को जूते इसलिए दिए;\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"हरीबा\",\n" +
            "              \"बेबी\",\n" +
            "              \" गोपू\",\n" +
            "              \"सुमन\"\n" +
            "            ],\n" +
            "            \"question\": \"मोची का नाम क्या है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \"बेबी ने नए जूते दिया |\",\n" +
            "              \"मेरी लाइन बदल दीजिए |\",\n" +
            "              \"मुझे हमेशा इसी लाइन पर काम करना है |\",\n" +
            "              \"मुझे नए जूते मिला |\"\n" +
            "            ],\n" +
            "            \"question\": \" पोस्टमैन ने  बडे बाबू से क्या कहा?\"\n" +
            "          }\n" +
            "        ]\n" +
            "      },\n" +
            "      {\n" +
            "        \"id\": \"पाठ 2 तूफ़ानों की ओर घुमा दो नाविक\",\n" +
            "        \"questions\": [\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"कविता\",\n" +
            "              \"कहानी\",\n" +
            "              \"पटकथा\",\n" +
            "              \"लेख\"\n" +
            "            ],\n" +
            "            \"question\": \" तूफानों  की ओर घुमा दो नाविक किस विधा की रचना है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"c\",\n" +
            "            \"options\": [\n" +
            "              \"वरुण ग्रोवर\",\n" +
            "              \"मुक्तिबोध\",\n" +
            "              \"शिवमंगल सिंह 'सुमन'\",\n" +
            "              \"नरेंद्र पुंडरीक\"\n" +
            "            ],\n" +
            "            \"question\": \"तूफानों की ओर घुमा दो नाविक कविता की रचनाकार कौन है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \"मानव जीवन का\",\n" +
            "              \"जीवन में  होने वाला संकटों का\",\n" +
            "              \"मानव का\",\n" +
            "              \"संसार का\"\n" +
            "            ],\n" +
            "            \"question\": \"कविता में तूफ़ान  किसका प्रतीक है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"d\",\n" +
            "            \"options\": [\n" +
            "              \"संगठन का\",\n" +
            "              \"मानव जीवन का\",\n" +
            "              \"ताकत का\",\n" +
            "              \"मानव का\"\n" +
            "            ],\n" +
            "            \"question\": \"कविता में नाविक किसका प्रतीक है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"पतवार तूफानों की ओर घुमा ने को\",\n" +
            "              \"डर के पीछे भागने को\",\n" +
            "              \"रोने को\",\n" +
            "              \"हार मानने को\"\n" +
            "            ],\n" +
            "            \"question\": \"कवि नाविक से क्या  कहते  हैं?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"d\",\n" +
            "            \"options\": [\n" +
            "              \"लहरों का\",\n" +
            "              \"सागर का\",\n" +
            "              \"पुतले का\",\n" +
            "              \"तूफ़ानों का\"\n" +
            "            ],\n" +
            "            \"question\": \"जीवन में कभी कभी किस का प्यार मिलता है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \"विजय\",\n" +
            "              \"सर्वनाश\",\n" +
            "              \" खुशी\",\n" +
            "              \"संकट\"\n" +
            "            ],\n" +
            "            \"question\": \"तूफ़ानों का परिणाम क्या होता है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"d\",\n" +
            "            \"options\": [\n" +
            "              \"विश्व\",\n" +
            "              \"विष \",\n" +
            "              \"प्यार\",\n" +
            "              \"मिट्टी के पुतले\"\n" +
            "            ],\n" +
            "            \"question\": \"यह असीम,निज सीमा जाने सागर भी तो यह पहचाने-- -- -- -- -- -- --मानव ने कभी न मानी हार \"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"फूलों का शो\",\n" +
            "              \"जीवन के गान\",\n" +
            "              \"मिट्टी की बारात\",\n" +
            "              \"युग का मोल\"\n" +
            "            ],\n" +
            "            \"question\": \"इसमें कौन सा रचना शिवमंगल सिंह सुमन का नहीं है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"तूफ़ान \",\n" +
            "              \"लहर\",\n" +
            "              \"सागर\",\n" +
            "              \"संकट\"\n" +
            "            ],\n" +
            "            \"question\": \"जीवन में कभी कभी संकट रूपी ------ का सामना करना पड़ता है|\"\n" +
            "          }\n" +
            "        ]\n" +
            "      }\n" +
            "    ],\n" +
            "    \"id\": \"इकाई3\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"chapters\": [\n" +
            "      {\n" +
            "        \"id\": \"पाठ 2  *संसार पुस्तक है।*\",\n" +
            "        \"questions\": [\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \"संस्मरण\",\n" +
            "              \"पत्र \",\n" +
            "              \"लोककथा\",\n" +
            "              \"नाटक\"\n" +
            "            ],\n" +
            "            \"question\": \"*संसार पुस्तक है* किस विधा की रचना है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"c\",\n" +
            "            \"options\": [\n" +
            "              \"प्रेमचंद\",\n" +
            "              \"आमोद कारखानिस\",\n" +
            "              \"जवाहरलाल नेहरू\",\n" +
            "              \"डॉ.ए पी जे अब्दुल कलाम\"\n" +
            "            ],\n" +
            "            \"question\": \"संसार पुस्तक है  नामक पत्र का रचनाकार कौन है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"प्रेमचंद\",\n" +
            "              \"जवाहरलाल नेहरू\",\n" +
            "              \"मुक्तिबोध\",\n" +
            "              \"केदारनाथ सिंह\"\n" +
            "            ],\n" +
            "            \"question\": \"संसार पुस्तक है' यह पुस्तक का हिंदी अनुवादक कौन है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"इलाहाबाद  जेल \",\n" +
            "              \" मसूरी\",\n" +
            "              \"दिल्ली\",\n" +
            "              \"इंग्लैंड\"\n" +
            "            ],\n" +
            "            \"question\": \" इन पत्रों लिखते वक्त जवाहरलाल नेहरू कहाँ था?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"c\",\n" +
            "            \"options\": [\n" +
            "              \"पुस्तकों  पढ़ना है |\",\n" +
            "              \"दूसरों से पूछना है |\",\n" +
            "              \"संसार रूपी पुस्तक पढ़ना है|\",\n" +
            "              \"स्कूल में जाना है|\"\n" +
            "            ],\n" +
            "            \"question\": \"दुनिया का पुराना हाल जानने के लिए क्या करना है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"c\",\n" +
            "            \"options\": [\n" +
            "              \"हाथी\",\n" +
            "              \"घोड़े\",\n" +
            "              \"जानवरों\",\n" +
            "              \" पुस्तकों\"\n" +
            "            ],\n" +
            "            \"question\": \"आदमियों के पहले धरती में  कौन थे?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"aइंग्लैंड छोटा टापू है और हिंदुस्तान बड़ा देश है|\",\n" +
            "              \"इंग्लैंड बड़ा देश है और हिंदुस्तान छोटा टापू हैै|\",\n" +
            "              \"दोनों बड़ा देश है |\",\n" +
            "              \"दोनों टापू है|\"\n" +
            "            ],\n" +
            "            \"question\": \"इंग्लैंड और हिंदुस्तान में क्या फरक  है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"प्रकृति के अक्षर पढ़ना है| \",\n" +
            "              \"पहाड़ों को पढ़ना है |\",\n" +
            "              \"नदियों को पढ़ना है| \",\n" +
            "              \"जंगलों को पटना है|\"\n" +
            "            ],\n" +
            "            \"question\": \" संसार रूपी पुस्तक पढ़ने के लिए पहले क्या करना  है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"c\",\n" +
            "            \"options\": [\n" +
            "              \"दोस्त \",\n" +
            "              \"पत्नी\",\n" +
            "              \"बेटी \",\n" +
            "              \" पिता \"\n" +
            "            ],\n" +
            "            \"question\": \"जवाहरलाल नेहरू ने यह पत्र किसके लिए लिखा?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"d\",\n" +
            "            \"options\": [\n" +
            "              \"सेवासदन\",\n" +
            "              \"प्रेमाश्रम\",\n" +
            "              \"गोदान\",\n" +
            "              \"संसार पुस्तक है।\"\n" +
            "            ],\n" +
            "            \"question\": \"इसमें कौन सा रचना प्रेमचंद का नहीं है?\"\n" +
            "          }\n" +
            "        ]\n" +
            "      }\n" +
            "    ],\n" +
            "    \"id\": \"इकाई 4\"\n" +
            "  }\n" +
            "]";
}

