package com.example.selfevaluation.data;

import com.example.selfevaluation.model.Module;
import com.google.gson.Gson;

import java.util.ArrayList;
import java.util.LinkedHashMap;
import java.util.List;

public class Data {


    public static LinkedHashMap<String, List<String>> getViewData() {

        LinkedHashMap<String, List<String>> expandableListDetail = new LinkedHashMap<>();
        Module[] modules = getData();
        for (Module module : modules) {
            String title = module.getId();
            List<String> list = new ArrayList<>();
            for (int k = 0; k < module.getChapters().size(); k++) {
                list.add(module.getChapters().get(k).getId());
            }
            expandableListDetail.put(title, list);
        }

        return expandableListDetail;
    }

    public static Module[] getData() {
        Gson gson = new Gson();
        return gson.fromJson(JSON_DATA, Module[].class);
    }

    //    private static final String JSON_DATA = "[{ \"chapters\": [{ \"id\": \"पाठ 1 - जिस गली में मैं रहता हूँ।\", \"questions\": [{ \"answer\": \"d\", \"options\": [ \"लेख\", \"कहानी \", \"कविता \", \"डायरी\" ], \"question\": \"जिस गली में मैं रहता हूँ नामक पाठ भाग किस विधा की रचना है?\" }, { \"answer\": \"d\", \"options\": [ \"अरविंद गुप्ता\", \"प्रेमचंद\", \"मिर्जा गालिब \", \"डॉ कैलाश नारद\" ], \"question\": \"इस डायरी का अनुवादक का नाम क्या है?\" }, { \"answer\": \"a\", \"options\": [ \" दिल्ली\", \"मुंबई\", \"मधुरा\", \"आगरा\" ], \"question\": \"डायरी में प्रतिपादित प्रदेश का नाम क्या है?\" }, { \"answer\": \"c\", \"options\": [ \"5 सितंबर 1857\", \"5 जून 1857\", \"5 अक्टूबर 1857\", \"5 मई 1857\" ], \"question\": \"मिर्जा गालिब के अनुसार असली मुसीबत कब आई?\" }, { \"answer\": \"d\", \"options\": [ \"काला\", \"हरा\", \"पीला\", \"सुर्ख\" ], \"question\": \"ब्राउन का चेहरा ------था |\" }, { \"answer\": \"a\", \"options\": [ \"कविता लिखते हैं | \", \"पुलिस में काम करते हैं |\", \"अध्यापन कार्य करता हैं |\", \"बिना काम |\" ], \"question\": \"मिर्जा गालिब क्या करते हैं ?\" }, { \"answer\": \"a\", \"options\": [ \"भिश्ती\", \"शिल्पी\", \"अध्यापक\", \"दुकानदार\" ], \"question\": \"चिराग अली कौन था?\" }, { \"answer\": \"a\", \"options\": [ \"हड़सन\", \"ब्राउन\", \"डायर\", \"मिन्टो\" ], \"question\": \"चिराग अली को किसने मारा?\" }, { \"answer\": \"b\", \"options\": [ \"बालमुकुंद\", \"हरिगोपाल तुफ्ता\", \"हीराराम\", \"हीरा सिंह\" ], \"question\": \"मिर्जा गालिब का दोस्त का नाम क्या है?\" }, { \"answer\": \"c\", \"options\": [ \"मिर्जा गालिब\", \"हडसन\", \"हीरा सिंह\", \"हरि गोपाल\" ], \"question\": \"बालमुकुंद का पिता का नाम क्या है?\" } ] }, { \"id\": \"पाठ 2- गाँधीजी गाँधीजी कैसे बने\", \"questions\": [{ \"answer\": \"b\", \"options\": [ \"डॉ कैलाश नारद\", \"स्वयंप्रकाश\", \"वरुण ग्रोवर\", \"अरविंद गुप्ता\" ], \"question\": \"'गांधीजी गांधीजी कैसे बने' लेख का रचनाकार कौन है?\" }, { \"answer\": \"a\", \"options\": [ \"अंधेरे से\", \"जानवरों से\", \"अंग्रेजों से\", \"गणित से\" ], \"question\": \" बचपन में गांधीजी को किस से डर था?\" }, { \"answer\": \"c\", \"options\": [ \" इंग्लैंड\", \"दक्षिण अफ्रीका\", \"मदुरै\", \"लंदन\" ], \"question\": \"अब मैं सिर्फ एक धोती ही पहनूँगा* यह फ़ैसला गाँधीजी कहाँ जाने के बाद लिया?\" }, { \"answer\": \"c\", \"options\": [ \"पुतली बाई को\", \"मणिलाल गांधी को\", \"भारत के वायसरॉय को\", \"रानी को\" ], \"question\": \"गांधीजी अपने पेंसिल से पहली चिट्ठी किसको लिखी?\" }, { \"answer\": \"c\", \"options\": [ \"पेंसिल\", \"धोती\", \"तीन बंदर की खिलौना\", \"जूते\" ], \"question\": \"चीनी बच्चों ने गांधीजी को क्या दिया\" }, { \"answer\": \"d\", \"options\": [ \"मदुरै \", \"दक्षिण अफ्रीका\", \"बरमा\", \"लंदन\" ], \"question\": \" गांधीजी गोल मेज सम्मेलन के लिए कहां गए थे?\" }, { \"answer\": \"b\", \"options\": [ \"पाँचवां\", \"पहला\", \"दसवाँ\", \"तीसरा\" ], \"question\": \"गांधीजी को काठियावाड़ हाई स्कूल में कौन सी कक्षा में भर्ती मिला?\" }, { \"answer\": \"a\", \"options\": [ \"20 जनवरी 1947\", \"20 फरवरी 1947\", \"10 जनवरी 1947\", \"10 फरवरी 1947\" ], \"question\": \"स्वयंप्रकाश का जन्म कब हुई?\" }, { \"answer\": \"d\", \"options\": [ \"सूरज कब निकलेगा |\", \"आएंगे अच्छे दिन भी |\", \"गांधीजी गांधीजी कैसे बने |\", \"नंगे पैर\" ], \"question\": \"इस में कौन सा रचना स्वयंप्रकाश का नहीं है?\" }, { \"answer\": \"a\", \"options\": [ \"औरत की\", \"चीनी बच्चों की\", \"अमीर आदमी की\", \"दक्षिण अफ्रीका के लोगों की\" ], \"question\": \"किसकी हालत देखकर गांधीजी एक धोती पहनने की फ़ैंसला लिया?\" } ] } ], \"id\": \"इकाई 2\" }, { \"chapters\": [{ \"id\": \"पाठ 1 नंगे पैर\", \"questions\": [{ \"answer\": \"a\", \"options\": [ \"कहानी\", \"लोककथा\", \"कविता\", \"पटकथा\" ], \"question\": \"*नंगे पैर* किस विधा की रचना है?\" }, { \"answer\": \"c\", \"options\": [ \"मिर्जा गालिब\", \"स्वयं प्रकाश\", \"वेंकटेश माडगुलकर \", \"नरेंद्र पुंडरीक\" ], \"question\": \"नंगे पैर कहानी का रचनाकार कौन है?\" }, { \"answer\": \"d\", \"options\": [ \"लल्लू\", \"वरुण ग्रोवर\", \"मेहरून्निसा\", \"बेबी\" ], \"question\": \" नंगे पैर कहानी का मुख्य पात्र का नाम क्या है?\" }, { \"answer\": \"c\", \"options\": [ \" खाना खा रही थी |\", \"टीवी देख रही थी |\", \"पलंग पर बैठी खिड़की से बाहर देख रही थी |\", \"खेल रही थी |\" ], \"question\": \"दोपहर का समय बेबी क्या कर रही थी?\" }, { \"answer\": \"d\", \"options\": [ \"बाप\", \"नाना\", \"दीदी\", \"माँ \" ], \"question\": \"बेबी ने डाक किसके हाथ में दिया?\" }, { \"answer\": \"a\", \"options\": [ \"पोस्टमैन\", \"मोची\", \" माँ \", \"बाप\" ], \"question\": \"दोपहर को बेबी के घर में कौन आया?\" }, { \"answer\": \"c\", \"options\": [ \" पत्र \", \"कलम\", \"जूते\", \"खाना\" ], \"question\": \"बेबी पोस्टमैन को क्या तैयार करके दिया?\" }, { \"answer\": \"c\", \"options\": [ \"बेबी के पास पोस्टमैन को देने के लिए पैसा नहीं था |\", \"पिताजी ने पोस्टमैन को जूते देने को कहा था |\", \"बेबी ने पोस्टमैन को कड़ी धूप में नंगे पैर चलते देखा था |\", \"पोस्टमैने ने बेबी से जूते माँगे थे |\" ], \"question\": \"बेबी ने पोस्टमैन को जूते इसलिए दिए;\" }, { \"answer\": \"a\", \"options\": [ \"हरीबा\", \"बेबी\", \" गोपू\", \"सुमन\" ], \"question\": \"मोची का नाम क्या है?\" }, { \"answer\": \"b\", \"options\": [ \"बेबी ने नए जूते दिया |\", \"मेरी लाइन बदल दीजिए |\", \"मुझे हमेशा इसी लाइन पर काम करना है |\", \"मुझे नए जूते मिला |\" ], \"question\": \" पोस्टमैन ने बडे बाबू से क्या कहा?\" } ] }, { \"id\": \"पाठ 2 तूफ़ानों की ओर घुमा दो नाविक\", \"questions\": [{ \"answer\": \"a\", \"options\": [ \"कविता\", \"कहानी\", \"पटकथा\", \"लेख\" ], \"question\": \" तूफानों की ओर घुमा दो नाविक किस विधा की रचना है?\" }, { \"answer\": \"c\", \"options\": [ \"वरुण ग्रोवर\", \"मुक्तिबोध\", \"शिवमंगल सिंह 'सुमन'\", \"नरेंद्र पुंडरीक\" ], \"question\": \"तूफानों की ओर घुमा दो नाविक कविता की रचनाकार कौन है?\" }, { \"answer\": \"b\", \"options\": [ \"मानव जीवन का\", \"जीवन में होने वाला संकटों का\", \"मानव का\", \"संसार का\" ], \"question\": \"कविता में तूफ़ान किसका प्रतीक है?\" }, { \"answer\": \"d\", \"options\": [ \"संगठन का\", \"मानव जीवन का\", \"ताकत का\", \"मानव का\" ], \"question\": \"कविता में नाविक किसका प्रतीक है?\" }, { \"answer\": \"a\", \"options\": [ \"पतवार तूफानों की ओर घुमा ने को\", \"डर के पीछे भागने को\", \"रोने को\", \"हार मानने को\" ], \"question\": \"कवि नाविक से क्या कहते हैं?\" }, { \"answer\": \"d\", \"options\": [ \"लहरों का\", \"सागर का\", \"पुतले का\", \"तूफ़ानों का\" ], \"question\": \"जीवन में कभी कभी किस का प्यार मिलता है?\" }, { \"answer\": \"b\", \"options\": [ \"विजय\", \"सर्वनाश\", \" खुशी\", \"संकट\" ], \"question\": \"तूफ़ानों का परिणाम क्या होता है?\" }, { \"answer\": \"d\", \"options\": [ \"विश्व\", \"विष \", \"प्यार\", \"मिट्टी के पुतले\" ], \"question\": \"यह असीम,निज सीमा जाने सागर भी तो यह पहचाने-- -- -- -- -- -- --मानव ने कभी न मानी हार \" }, { \"answer\": \"a\", \"options\": [ \"फूलों का शो\", \"जीवन के गान\", \"मिट्टी की बारात\", \"युग का मोल\" ], \"question\": \"इसमें कौन सा रचना शिवमंगल सिंह सुमन का नहीं है?\" }, { \"answer\": \"a\", \"options\": [ \"तूफ़ान \", \"लहर\", \"सागर\", \"संकट\" ], \"question\": \"जीवन में कभी कभी संकट रूपी ------ का सामना करना पड़ता है|\" } ] } ], \"id\": \"इकाई3\" }, { \"chapters\": [{ \"id\": \"पाठ 2 *संसार पुस्तक है।*\", \"questions\": [{ \"answer\": \"b\", \"options\": [ \"संस्मरण\", \"पत्र \", \"लोककथा\", \"नाटक\" ], \"question\": \"*संसार पुस्तक है* किस विधा की रचना है?\" }, { \"answer\": \"c\", \"options\": [ \"प्रेमचंद\", \"आमोद कारखानिस\", \"जवाहरलाल नेहरू\", \"डॉ.ए पी जे अब्दुल कलाम\" ], \"question\": \"संसार पुस्तक है नामक पत्र का रचनाकार कौन है?\" }, { \"answer\": \"a\", \"options\": [ \"प्रेमचंद\", \"जवाहरलाल नेहरू\", \"मुक्तिबोध\", \"केदारनाथ सिंह\" ], \"question\": \"संसार पुस्तक है' यह पुस्तक का हिंदी अनुवादक कौन है?\" }, { \"answer\": \"a\", \"options\": [ \"इलाहाबाद जेल \", \" मसूरी\", \"दिल्ली\", \"इंग्लैंड\" ], \"question\": \" इन पत्रों लिखते वक्त जवाहरलाल नेहरू कहाँ था?\" }, { \"answer\": \"c\", \"options\": [ \"पुस्तकों पढ़ना है |\", \"दूसरों से पूछना है |\", \"संसार रूपी पुस्तक पढ़ना है|\", \"स्कूल में जाना है|\" ], \"question\": \"दुनिया का पुराना हाल जानने के लिए क्या करना है?\" }, { \"answer\": \"c\", \"options\": [ \"हाथी\", \"घोड़े\", \"जानवरों\", \" पुस्तकों\" ], \"question\": \"आदमियों के पहले धरती में कौन थे?\" }, { \"answer\": \"a\", \"options\": [ \"aइंग्लैंड छोटा टापू है और हिंदुस्तान बड़ा देश है|\", \"इंग्लैंड बड़ा देश है और हिंदुस्तान छोटा टापू हैै|\", \"दोनों बड़ा देश है |\", \"दोनों टापू है|\" ], \"question\": \"इंग्लैंड और हिंदुस्तान में क्या फरक है?\" }, { \"answer\": \"a\", \"options\": [ \"प्रकृति के अक्षर पढ़ना है| \", \"पहाड़ों को पढ़ना है |\", \"नदियों को पढ़ना है| \", \"जंगलों को पटना है|\" ], \"question\": \" संसार रूपी पुस्तक पढ़ने के लिए पहले क्या करना है?\" }, { \"answer\": \"c\", \"options\": [ \"दोस्त \", \"पत्नी\", \"बेटी \", \" पिता \" ], \"question\": \"जवाहरलाल नेहरू ने यह पत्र किसके लिए लिखा?\" }, { \"answer\": \"d\", \"options\": [ \"सेवासदन\", \"प्रेमाश्रम\", \"गोदान\", \"संसार पुस्तक है।\" ], \"question\": \"इसमें कौन सा रचना प्रेमचंद का नहीं है?\" } ] }], \"id\": \"इकाई 4\" } ]";
    private static final String JSON_DATA = "[\n" +
            "  {\n" +
            "    \"chapters\": [\n" +
            "      {\n" +
            "        \"id\": \"पाठ 1 -सुख दुख ।\",\n" +
            "        \"questions\": [\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \"कहानी\",\n" +
            "              \"कविता \",\n" +
            "              \"नाटक     \",\n" +
            "              \" पटकथा\"\n" +
            "            ],\n" +
            "            \"question\": \" सुख दुख किस विधा की रचना   है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"c\",\n" +
            "            \"options\": [\n" +
            "              \"सुख की\",\n" +
            "              \"दुख की\",\n" +
            "              \" सुख-दुख की\",\n" +
            "              \"इच्छाओं की\"\n" +
            "            ],\n" +
            "            \"question\": \"किन किन की खेल मिचौनी है जीवन?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"सुमित्रानंदन पंत\",\n" +
            "              \" निराला \",\n" +
            "              \"जयशंकर प्रसाद\",\n" +
            "              \"महादेवी वर्मा\"\n" +
            "            ],\n" +
            "            \"question\": \" सुख दुख की लेखक कौन है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \" गुंजन\",\n" +
            "              \"चिदम्बरा\",\n" +
            "              \"लोकायतन\",\n" +
            "              \"पल्लव\"\n" +
            "            ],\n" +
            "            \"question\": \" किस रचना पर पंत जी को ज्ञानपीठ पुरस्कार मिला?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"c\",\n" +
            "            \"options\": [\n" +
            "              \"सुख से\",\n" +
            "              \"दुख से\",\n" +
            "              \"सुख दुख के मधुर मिलान से\",\n" +
            "              \"कोई नही\"\n" +
            "            ],\n" +
            "            \"question\": \"जीवन कब परिपूर्ण हो जाता है?\"\n" +
            "          }\n" +
            "        ]\n" +
            "      },\n" +
            "      {\n" +
            "        \"id\": \"पाठ 2- पिता का प्रायश्चिते\",\n" +
            "        \"questions\": [\n" +
            "          {\n" +
            "            \"answer\": \"c\",\n" +
            "            \"options\": [\n" +
            "              \"कहानी\",\n" +
            "              \"कविता \",\n" +
            "              \"संस्मरण\",\n" +
            "              \"एकांकी\"\n" +
            "            ],\n" +
            "            \"question\": \" ' पिता का प्रायश्चित ' साहित्य की किस विधा की रचना है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \" मनीलाल गाँधी\",\n" +
            "              \"अरुण गाँधी\",\n" +
            "              \" मोहन गाँधी\",\n" +
            "              \" अरविंद गाँधी\"\n" +
            "            ],\n" +
            "            \"question\": \"' पिता का प्रायश्चित्त ' का रचयिता कौन है ? \"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \" मनीलाल गाँधी\",\n" +
            "              \" महात्मा गांधी\",\n" +
            "              \"मोहन गाँधी\",\n" +
            "              \"अरविंद गांधी\"\n" +
            "            ],\n" +
            "            \"question\": \" अरुण गाँधी  के दादाजी का नाम क्या है ?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \" मनीलाल गाँधी\",\n" +
            "              \" महात्मा गांधी\",\n" +
            "              \"मोहन गाँधी\",\n" +
            "              \"अरविंद गांधी\"\n" +
            "            ],\n" +
            "            \"question\": \" अरुण गांधी के पिता का नाम क्या है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"d\",\n" +
            "            \"options\": [\n" +
            "              \" मनीलाल गाँधी\",\n" +
            "              \" अरुण गाँधी\",\n" +
            "              \"मोहन गाँधी\",\n" +
            "              \"अरविंद गुप्ता\"\n" +
            "            ],\n" +
            "            \"question\": \" किस ने ' पिता का प्रायश्चित ' संस्मरण हिंदी में अनुवाद किया? \"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \" मनीलाल गाँधी का \",\n" +
            "              \"अरुण गांधी का \",\n" +
            "              \"महात्मा गाँधी का \",\n" +
            "              \" कोई नही\"\n" +
            "            ],\n" +
            "            \"question\": \" \\\"उस दिन मैं ने जीवन का अहम निर्णय लिया मैं कभी भी झूठ नहीं बोलूंगा \\\" यह किसका निर्णय था?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"महात्मा गाँधी\",\n" +
            "              \"मनीलाल गाँधी\",\n" +
            "              \"अरुण गाँधी\",\n" +
            "              \"कोई नही\"\n" +
            "            ],\n" +
            "            \"question\": \" आश्रम की स्थापना किसने किया ? \"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \"केप टाउन\",\n" +
            "              \"डरबन\",\n" +
            "              \"प्रिटोरिया\",\n" +
            "              \"अमेरिका\"\n" +
            "            ],\n" +
            "            \"question\": \"आश्रम कहाँ स्थित है? \"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"सिनेमा घर \",\n" +
            "              \"मित्रों को मिलने केलिए\",\n" +
            "              \"समुद्र देखने केलिए\",\n" +
            "              \"कोई नहीं\"\n" +
            "            ],\n" +
            "            \"question\": \" पिताजी को मीटिंग स्थान पर छोड़कर अरुण गाँधी  कहाँ गया था? \"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \"प्रतीक्षा\",\n" +
            "              \"अवसर\",\n" +
            "              \"प्रदेश\",\n" +
            "              \"आशा\"\n" +
            "            ],\n" +
            "            \"question\": \"मौका शब्द का अर्थ क्या है ? \"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \"पिता के दोस्तों से मिलने केलिए\",\n" +
            "              \"पिता को वहाँ एक मीटिंग थी\",\n" +
            "              \"सिनेमा देखने केलिए\",\n" +
            "              \"उपरोक्त सभी\"\n" +
            "            ],\n" +
            "            \"question\": \"किस आवश्य केलिए अरुण गाँधी पिता के साथ शहर गयी?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \"16 मील\",\n" +
            "              \"18 मील\",\n" +
            "              \"20 मील\",\n" +
            "              \"8 मील\"\n" +
            "            ],\n" +
            "            \"question\": \"डरबन से कितने मील दूर था आश्रम?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"बेटे ने पिताजी से\",\n" +
            "              \"पिताजी ने बेटे से\",\n" +
            "              \"पिताजी ने दोस्तों से\",\n" +
            "              \"कोई नहीं\"\n" +
            "            ],\n" +
            "            \"question\": \" \\\"कार तैयार नहीं थी इसलिए देर हो गयी \\\" यह किसने किससे कहा? \"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"पिताजी का \",\n" +
            "              \"बेटे का \",\n" +
            "              \"दादाजी का\",\n" +
            "              \"माताजी का \"\n" +
            "            ],\n" +
            "            \"question\": \" \\\"घर तक कि अठारह मील की दूरी पैदल चलकर ही तय करूंगा ।\\\" यह किसका निर्णय था?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \" बेटा लेट होने से\",\n" +
            "              \"बेटा झूठ  बोलने से\",\n" +
            "              \" उपरोक्त सभी\",\n" +
            "              \"दोनों नहीं\"\n" +
            "            ],\n" +
            "            \"question\": \"घर तक की अठारह मील की दूरी पैदल चलने का निर्णय पिताजी ने क्यों लिया?\"\n" +
            "          }\n" +
            "        ]\n" +
            "      },\n" +
            "      {\n" +
            "        \"id\": \"पाठ 3- उजाला\",\n" +
            "        \"questions\": [\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \"कविता\",\n" +
            "              \"कहानी\",\n" +
            "              \"संस्मरण\",\n" +
            "              \"नाटक\"\n" +
            "            ],\n" +
            "            \"question\": \"उजाला साहित्य की किस विधा की रचना है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"सेवक राम यात्री\",\n" +
            "              \"सुमित्रानंदन पंत\",\n" +
            "              \"अरविंद गुप्ता\",\n" +
            "              \"रमणी अटकुरी\"\n" +
            "            ],\n" +
            "            \"question\": \"उजाला किसकी रचना है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \"रेल्वे स्टेशन\",\n" +
            "              \"जवहर कॉलनी\",\n" +
            "              \"अस्पताल\",\n" +
            "              \"कोई नहीं\"\n" +
            "            ],\n" +
            "            \"question\": \"कहानीकार रिक्शा चालकों से कहाँ चलने को कहा?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"रास्ता सुनसान था\",\n" +
            "              \"सड़क अच्छा नही था\",\n" +
            "              \"वहाँ की लोग अच्छा नही था\",\n" +
            "              \"उपरोक्त सभी\"\n" +
            "            ],\n" +
            "            \"question\": \"कोई भी रिक्शा चालक जवहर कॉलनी जाने में तैयार नहीं है इसका कारण क्या था?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"अंधे राहगीरों में से एक ने लेखक से कहा\",\n" +
            "              \"लेखक ने अंधे राहगीरों से कहा\",\n" +
            "              \"लेखक ने गाड़ीवाले से कहा\",\n" +
            "              \"कोई नहीं\"\n" +
            "            ],\n" +
            "            \"question\": \"\\\"बाबूजी, लालटेन हम अपने वास्ते लेकर नहीं चल रहे हैं ।\\\" यह किसने किससे कहा?\"\n" +
            "          }\n" +
            "        ]\n" +
            "      },\n" +
            "      {\n" +
            "        \"id\": \"पाठ 4-मेरे बच्चे को सिखाएं...\",\n" +
            "        \"questions\": [\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"पत्र\",\n" +
            "              \"कहानी\",\n" +
            "              \"पटकथा \",\n" +
            "              \"कविता\"\n" +
            "            ],\n" +
            "            \"question\": \"'मेरे बच्चे को सिखाएं' यह किस विधा की रचना है? \"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \"महात्मा गाँधी\",\n" +
            "              \"अब्रहाम लिंकन\",\n" +
            "              \"जवाहरलाल नेहरू\",\n" +
            "              \"ए पी जे अब्दुल कलाम\"\n" +
            "            ],\n" +
            "            \"question\": \" 'मेरे बच्चे को सिखाएं' किसकी रचना है?\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"अपने पुत्र के शिक्षक के नाम पर\",\n" +
            "              \"अपने पोते के शिक्षक के नाम पर\",\n" +
            "              \"अपने बेटी के शिक्षक के नाम पर\",\n" +
            "              \" उपरोक्त सभी को\"\n" +
            "            ],\n" +
            "            \"question\": \"अब्रहाम लिंकन ने यह पत्र किसके नाम पर लिखा? \"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"a\",\n" +
            "            \"options\": [\n" +
            "              \"मेहनत से कमाया पैसा\",\n" +
            "              \"धोखे से कमाया पैसा\",\n" +
            "              \"अन्याय से कमाया पैसा\",\n" +
            "              \"उपरोक्त सभी\"\n" +
            "            ],\n" +
            "            \"question\": \"किस प्रकार का पैसा मूल्यवान है? \"\n" +
            "          },\n" +
            "          {\n" +
            "            \"answer\": \"b\",\n" +
            "            \"options\": [\n" +
            "              \"स्वार्थ राजनीतिज्ञ\",\n" +
            "              \"सत्य और न्याय से व्यवहार करनेवाला\",\n" +
            "              \"अन्याय व्यवहार करनेवाला\",\n" +
            "              \"उपरोक्त सभी\"\n" +
            "            ],\n" +
            "            \"question\": \" निम्नलिखित चरित्रगत विशेषताओं में से अब्रहाम लिंकन की विशेषता क्या है? \"\n" +
            "          }\n" +
            "        ]\n" +
            "      }\n" +
            "    ],\n" +
            "    \"id\": \"इकाई 2\"\n" +
            "  }\n" +
            "]";
}

